module API
  module V1
    class City < Grape::API
      resource :cities do
        get '/' do
          {
              "city" => [
                  {
                      "code" => "0210",
                      "name" => "上海",
                      "pinyin" => "shanghai",
                      "is_hot" => true,
                      "gaode_lat" => "31.206791",
                      "gaode_lng" => "121.5415465"
                  },
                  {
                      "code" => "0211",
                      "name" => "广州",
                      "pinyin" => "guangzhou",
                      "is_hot" => true,
                      "gaode_lat" => "31.206791",
                      "gaode_lng" => "121.5415465"
                  }
              ]
          }
        end
      end

      resource :regions do
        get '/:city_code' do
          {
              "region" => {
                "id" => params[:city_code],
                "regions" => [
                    {
                        "name" => "虹口区"
                    },
                    {
                        "name" => "闸北区"
                    },
                    {
                        "name" => "卢湾区"
                    },
                    {
                        "name" => "徐汇区"
                    },
                    {
                        "name" => "杨浦区"
                    },
                    {
                        "name" => "静安区"
                    },
                    {
                        "name" => "长宁区"
                    },
                    {
                        "name" => "松江区"
                    },
                    {
                        "name" => "闵行区"
                    },
                    {
                        "name" => "浦东新区"
                    },
                    {
                        "name" => "普陀区"
                    },
                    {
                        "name" => "嘉定区"
                    },
                    {
                        "name" => "宝山区"
                    },
                    {
                        "name" => "黄浦区"
                    },
                    {
                        "name" => "奉贤区"
                    },
                    {
                        "name" => "崇明区"
                    },
                    {
                        "name" => "金山区"
                    },
                    {
                        "name" => "青浦区"
                    }
                ],
                "landmarks" => [
                    {
                        "name" => "徐家汇商业区"
                    },
                    {
                        "name" => "中山公园商业区"
                    },
                    {
                        "name" => "漕河泾地区"
                    },
                    {
                        "name" => "曹杨真如地区"
                    },
                    {
                        "name" => "宝山地区"
                    },
                    {
                        "name" => "漕河泾开发区"
                    },
                    {
                        "name" => "虹桥机场地区"
                    },
                    {
                        "name" => "沪太、彭浦地区"
                    },
                    {
                        "name" => "江湾、大柏树地区"
                    },
                    {
                        "name" => "静安寺地区"
                    },
                    {
                        "name" => "闵行地区"
                    },
                    {
                        "name" => "浦东机场区域"
                    },
                    {
                        "name" => "浦东金桥地区"
                    },
                    {
                        "name" => "浦东陆家嘴金融贸易区"
                    },
                    {
                        "name" => "浦东世博园区"
                    },
                    {
                        "name" => "浦东新国际博览中心"
                    },
                    {
                        "name" => "浦东张江地区"
                    },
                    {
                        "name" => "火车南站区"
                    },
                    {
                        "name" => "火车站地区"
                    },
                    {
                        "name" => "上海周边度假区"
                    },
                    {
                        "name" => "四川北路商业区"
                    },
                    {
                        "name" => "外滩附近"
                    },
                    {
                        "name" => "五角场商业区"
                    },
                    {
                        "name" => "豫园地区（城隍庙）"
                    },
                    {
                        "name" => "大宁国际休闲街"
                    },
                    {
                        "name" => "人民广场"
                    },
                    {
                        "name" => "大宁国际商城"
                    },
                    {
                        "name" => "七浦路服装批发市场"
                    },
                    {
                        "name" => "南京路步行街"
                    },
                    {
                        "name" => "长宁地区"
                    },
                    {
                        "name" => "淮海路商业区"
                    },
                    {
                        "name" => "南京西路商业圈"
                    },
                    {
                        "name" => "长寿路商业圈"
                    },
                    {
                        "name" => "上海北外滩商业区"
                    },
                    {
                        "name" => "八万人体育馆商圈"
                    },
                    {
                        "name" => "康桥、周浦地区"
                    },
                    {
                        "name" => "浦东外高桥"
                    },
                    {
                        "name" => "上海长途客运总站"
                    },
                    {
                        "name" => "光大会展中心"
                    },
                    {
                        "name" => "莘庄区域"
                    },
                    {
                        "name" => "虹桥枢纽区域"
                    },
                    {
                        "name" => "南京东路步行街"
                    },
                    {
                        "name" => "野生动物园"
                    },
                    {
                        "name" => "惠南镇"
                    },
                    {
                        "name" => "南汇桃花节"
                    },
                    {
                        "name" => "虹口足球场"
                    },
                    {
                        "name" => "康桥、周浦地区"
                    },
                    {
                        "name" => "虹口足球场"
                    },
                    {
                        "name" => "安亭地区"
                    },
                    {
                        "name" => "F1赛车场"
                    },
                    {
                        "name" => "新天地"
                    },
                    {
                        "name" => "曹安轻纺市场"
                    },
                    {
                        "name" => "虹桥火车站"
                    },
                    {
                        "name" => "江桥镇"
                    },
                    {
                        "name" => "七宝老街"
                    },
                    {
                        "name" => "北新泾"
                    },
                    {
                        "name" => "天山地区"
                    },
                    {
                        "name" => "九星建材市场"
                    },
                    {
                        "name" => "上海第一八佰伴"
                    },
                    {
                        "name" => "南汇大学城"
                    },
                    {
                        "name" => "复兴公园"
                    },
                    {
                        "name" => "田子坊艺术文化廊"
                    },
                    {
                        "name" => "日月光购物商场"
                    },
                    {
                        "name" => "三林"
                    },
                    {
                        "name" => "杨思"
                    },
                    {
                        "name" => "浦江地区"
                    },
                    {
                        "name" => "上海沪凯大厦"
                    },
                    {
                        "name" => "上海安亭二手车交易市场"
                    },
                    {
                        "name" => "上海安亭国际汽车会展中心"
                    },
                    {
                        "name" => "火车站嘉里不夜城"
                    },
                    {
                        "name" => "虹桥国家会展中心"
                    },
                    {
                        "name" => "大虹桥商务会展区域"
                    },
                    {
                        "name" => "光启城"
                    },
                    {
                        "name" => "大连路隧道"
                    },
                    {
                        "name" => "国展中心中环沿线"
                    },
                    {
                        "name" => "曹路宝龙广场商圈"
                    },
                    {
                        "name" => "上海欢乐谷"
                    },
                    {
                        "name" => "佘山"
                    },
                    {
                        "name" => "松江大学城"
                    },
                    {
                        "name" => "曹家渡商业区"
                    }
                ],
                "subways" => [
                    {
                        "name" => "地铁一号线"
                    },
                    {
                        "name" => "地铁二号线"
                    },
                    {
                        "name" => "地铁三号线"
                    },
                    {
                        "name" => "地铁四号线"
                    },
                    {
                        "name" => "地铁六号线"
                    },
                    {
                        "name" => "地铁八号线"
                    },
                    {
                        "name" => "地铁九号线"
                    },
                    {
                        "name" => "地铁十号线"
                    },
                    {
                        "name" => "地铁五号线"
                    },
                    {
                        "name" => "地铁七号线"
                    },
                    {
                        "name" => "地铁十一号线"
                    },
                    {
                        "name" => "地铁十三号线"
                    },
                    {
                        "name" => "地铁十六号线"
                    },
                    {
                        "name" => "地铁十二号线"
                    }
                ]
              }
          }          
        end
      end

    end
  end
end
